-- MySQL dump 10.13  Distrib 8.0.32, for Win64 (x86_64)
--
-- Host: localhost    Database: LittleExplorer
-- ------------------------------------------------------
-- Server version	8.0.32

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8mb4 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `comment`
--

DROP TABLE IF EXISTS `comment`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `comment` (
  `comment_id` int unsigned NOT NULL AUTO_INCREMENT,
  `kindergarten_id` int unsigned NOT NULL,
  `parent_id` int unsigned NOT NULL,
  `comment` varchar(1500) NOT NULL,
  `grade` tinyint unsigned DEFAULT NULL,
  `date` datetime(6) NOT NULL,
  PRIMARY KEY (`comment_id`),
  KEY `FK_parent_id_idx` (`parent_id`),
  KEY `FK_kindergarten_id_idx` (`kindergarten_id`),
  CONSTRAINT `FK_comment_kindergarten_id` FOREIGN KEY (`kindergarten_id`) REFERENCES `kindergarten` (`kindergarten_id`),
  CONSTRAINT `FK_parent_id` FOREIGN KEY (`parent_id`) REFERENCES `parent` (`parent_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `comment`
--

LOCK TABLES `comment` WRITE;
/*!40000 ALTER TABLE `comment` DISABLE KEYS */;
/*!40000 ALTER TABLE `comment` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `kindergarten`
--

DROP TABLE IF EXISTS `kindergarten`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `kindergarten` (
  `kindergarten_id` int unsigned NOT NULL AUTO_INCREMENT,
  `name` varchar(45) NOT NULL,
  `address` varchar(1000) NOT NULL,
  `region` varchar(100) NOT NULL,
  `min_age` smallint unsigned NOT NULL,
  `max_age` smallint unsigned NOT NULL,
  `capacity` smallint unsigned NOT NULL,
  `kids_count` smallint unsigned DEFAULT NULL,
  `num_of_teachers` smallint unsigned NOT NULL,
  `open_time` time NOT NULL,
  `close_time` time NOT NULL,
  `has_parking` tinyint unsigned DEFAULT NULL,
  PRIMARY KEY (`kindergarten_id`),
  UNIQUE KEY `kindergarten_id_UNIQUE` (`kindergarten_id`),
  FULLTEXT KEY `idx_kindergarten_name` (`name`)
) ENGINE=InnoDB AUTO_INCREMENT=178 DEFAULT CHARSET=utf8mb3;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `kindergarten`
--

LOCK TABLES `kindergarten` WRITE;
/*!40000 ALTER TABLE `kindergarten` DISABLE KEYS */;
INSERT INTO `kindergarten` VALUES (1,'גן הבית של מירב','וייצמן 32','גבעתיים',0,4,3,1,7,'17:00:00','00:00:52',NULL),(2,'גן גורים','הצנחנים 27','גבעתיים',0,2,6,2,7,'16:30:00','00:00:52',NULL),(3,'גן גנדנה','ביאליק 4','גבעתיים',1,3,8,2,7,'16:30:00','00:00:54',NULL),(4,'גן נמשים','גולומב 10','גבעתיים',3,6,20,3,7,'16:30:00','00:00:54',NULL),(5,'גן אחר','ריינס 38','גבעתיים',1,3,35,8,7,'16:30:00','00:00:54',NULL),(6,'הגן האקולוגי','שביל האספרגוס 34','גבעתיים',1,3,20,4,7,'17:00:00','00:00:00',NULL),(7,'הגן של אביה','שנקין 19','גבעתיים',0,3,18,4,7,'16:30:00','00:00:52',NULL),(8,'הגן של אלכס','משמר הירדן 22','גבעתיים',1,3,20,5,7,'16:30:00','00:00:00',NULL),(9,'משפחתון החברים של אילנה','שדרות הצנחנים 6 רמת גן','רמת גן',0,3,6,2,7,'18:00:00','00:00:00',NULL),(10,'גן ויצו גבעתיים','שדה בוקר 14','גבעתיים',0,3,25,5,7,'16:00:00','00:00:00',NULL),(11,'גן בגן','הרא\"ה 11','רמת גן',1,3,17,4,7,'16:30:00','00:00:54',NULL),(12,'גן דרור','המעין 1','גבעתיים',4,5,29,3,8,'15:30:00','00:00:03',NULL),(13,'גן חצב','אהרון שר 3','גבעתיים',4,5,32,4,8,'15:30:00','00:00:03',NULL),(14,'גן סתיוונית ','ריינס 2','גבעתיים',3,4,30,5,8,'15:30:00','00:00:03',NULL),(15,'גן סנונית','רותם 4','גבעתיים',4,5,28,4,8,'15:30:00','00:00:03',NULL),(16,'הגן של דפנה','ז\'בוטינסקי 22','גבעתיים',0,3,20,6,7,'17:00:00','00:00:00',NULL),(17,'גן הבית של אדל','הצנחנים 11','גבעתיים',0,3,15,4,7,'16:00:00','00:00:00',NULL),(18,'גן סיגל אומנויות','שדה בוקר 8','גבעתיים',0,5,35,7,7,'17:00:00','00:00:03',NULL),(19,'הגן של מיכל','הל\"ה 58','גבעתיים',2,4,14,3,7,'16:30:00','00:00:00',NULL),(20,'הפעוטון שלנו','אילת 8','גבעתיים',0,3,30,7,7,'17:00:00','00:00:00',NULL),(21,'המשפחתון של יפעת','ישראל טרייבר 59','גבעתיים',0,3,24,5,7,'16:30:00','00:00:54',NULL),(22,'גן שקד','צהל 28','גבעתיים',0,3,39,9,7,'16:45:00','00:00:00',NULL),(23,'גן הבית הקסום','דויד אלעזר 6','כפר סבא',1,3,60,6,7,'17:00:00','00:00:00',NULL),(24,'גן הבית של ורוניקה','סוקולוב 15','כפר סבא',1,4,30,4,7,'17:00:00','00:00:52',NULL),(25,'גן שוש','הדר 1','כפר סבא',0,3,20,3,7,'16:00:00','00:00:52',NULL),(26,'גן אנדנדינו','גולומב 5','כפר סבא',0,3,20,2,7,'17:00:00','00:00:54',NULL),(27,'משפחתון קרינה','סירני 2','כפר סבא',0,3,15,3,7,'17:00:00','00:00:54',NULL),(28,'המשפחתון של קלאודיה','משעול הקלע','כפר סבא',0,3,8,1,7,'17:00:00','00:00:00',NULL),(29,'גן דרור','רחוב ל\"ה 16','כפר סבא',0,3,30,4,7,'17:00:00','00:00:52',NULL),(30,'גן חיבוקאלה','אוסטשינסקי 23','כפר סבא',0,3,20,3,7,'17:00:00','00:00:00',NULL),(31,'גן שניניגן','השחר 6','כפר סבא',0,3,50,6,7,'17:00:00','00:00:54',NULL),(32,'גן דקלה','רחל המשוררת','כפר סבא',1,3,32,4,7,'16:45:00','00:00:54',NULL),(33,'גן קטקטים','גאולה 31','כפר סבא',1,3,20,3,7,'16:45:00','00:00:09',NULL),(34,'גן הארץ הקטנה','הגליל 56','כפר סבא',1,3,20,2,7,'17:00:00','00:00:54',NULL),(35,'מעון חב\"ד','רופין 30','כפר סבא',0,1,15,2,7,'16:00:00','00:00:09',NULL),(36,'גן הילדים בירוקה','רפפורט 3','כפר סבא',0,4,40,3,7,'16:45:00','00:00:54',NULL),(37,'גן דוריס','התאנה 3','כפר סבא',0,4,40,4,7,'17:00:00','00:00:09',NULL),(38,'גן החלומות','שאול המלך 5','כפר סבא',0,3,40,5,7,'17:00:00','00:00:00',NULL),(39,'גן פצפוני אורנים','יגאל ידין 2','כפר סבא',0,3,45,4,7,'17:00:00','00:00:00',NULL),(40,'גן דינה','המעפילים 18','כפר סבא',1,4,30,4,7,'17:00:00','00:00:09',NULL),(41,'גן אגדת ילדים','ניצנים 11','כפר סבא',0,4,40,4,7,'16:45:00','00:00:09',NULL),(42,'גן לב הזהב בקאנטרי כפר סבא','בן יהודה 23','כפר סבא',0,4,30,3,7,'17:00:00','00:00:54',NULL),(43,'גן ליבנה','העמק 28','כפר סבא',5,6,34,4,7,'17:00:00','00:00:09',NULL),(44,'גן מתנות קטנות','האילנות 20','כפר סבא',1,3,35,4,7,'17:00:00','00:00:54',NULL),(45,'גן בא-לי גן','יאנוש קורצ\'ק 10','כפר סבא',0,3,20,3,7,'17:00:00','00:00:50',NULL),(46,'הגן של שני ואלינור','ישראל ישעיהו 5','כפר סבא',1,4,30,4,7,'17:00:00','00:00:54',NULL),(47,'גן יעל','חבצלת השרון 13','כפר סבא',0,3,24,3,7,'16:30:00','00:00:00',NULL),(48,'גן הדס','אהרונוביץ\' 15','כפר סבא',4,5,20,3,7,'13:00:00','00:00:09',NULL),(49,'הגן של לימורי','טשרניחובסקי 4','כפר סבא',1,4,35,4,7,'16:30:00','00:00:54',NULL),(50,'גן חרצית','אביבים 10','כפר סבא',4,5,27,3,7,'14:00:00','00:00:09',NULL),(51,'אלמוגן','פשוש 6','כפר סבא',4,6,30,2,7,'14:00:00','00:00:09',NULL),(52,'גן תלתן','רש\"י 9','כפר סבא',4,6,30,4,7,'14:00:00','00:00:09',NULL),(53,'משפחתון גן כוכב','שדרות צנחנים 18','רמת גן',1,2,24,3,7,'16:45:00','00:00:00',NULL),(54,'גן מדינת הילדים','שדרות צנחנים 11','רמת גן',0,3,20,2,7,'16:30:00','00:00:00',NULL),(55,'גן בייבי קונסרבטוריון','שמעוני 10','רמת גן',0,3,25,3,7,'17:00:00','00:00:00',NULL),(56,'גן עינב (הגן הקסום)','תל חי 36','רמת גן',0,3,20,3,7,'16:00:00','00:00:00',NULL),(57,'גן אמנויות נילי','תל חי 68','רמת גן',0,3,36,5,7,'17:00:00','00:00:00',NULL),(58,'גן פעוטון דרקונצ\'יק','תל חי 47','רמת גן',0,3,30,6,7,'17:00:00','00:00:00',NULL),(59,'גן קן קטנטנים','משה דיין 13','רמת גן',0,3,40,5,7,'17:00:00','00:00:00',NULL),(60,'משפחתון חיפושית','התפוצות 40','רמת גן',0,3,15,3,7,'17:00:00','00:00:00',NULL),(61,'גן גפן','אחד העם 34','רמת גן',1,3,15,2,7,'17:00:00','00:00:00',NULL),(62,'גן כוכב','גרנדוס 35','רמת גן',0,3,20,3,7,'16:30:00','00:00:00',NULL),(63,'גן ורדית','עוזיאל 103','רמת גן',0,3,25,3,7,'16:00:00','00:00:00',NULL),(64,'גן חוחית','עוזיאל 103','רמת גן',0,3,25,4,7,'16:00:00','00:00:00',NULL),(65,'גן טבלן','בת שוע 9','רמת גן',0,3,25,5,7,'16:30:00','00:00:00',NULL),(66,'הגן של רמי','החי\"ל 38','רמת גן',0,3,20,2,7,'16:30:00','00:00:00',NULL),(67,'גן ניצנים','שדרות צנחנים 20','רמת גן',1,3,18,2,7,'16:30:00','00:00:00',NULL),(68,'גן מורן','המלאכה 14','רמת גן',1,3,22,3,7,'16:45:00','00:00:00',NULL),(69,'הגן של אילנית','אמיר 4','רמת גן',1,3,24,4,7,'17:00:00','00:00:00',NULL),(70,'גן תילתן','סמדר 19','רמת גן',0,3,18,3,7,'17:00:00','00:00:00',NULL),(71,'גן חוש חשים','השר משה 45','רמת גן',0,3,32,4,7,'16:30:00','00:00:00',NULL),(72,'גן הילדים של אורטלי','טרומן 29','רמת גן',0,3,40,6,7,'17:00:00','00:00:00',NULL),(73,'גן טינטן','בר יוחאי 11','רמת גן',1,2,26,4,7,'17:00:00','00:00:00',NULL),(74,'גן סנונית','הבעל שם טוב 15','רמת גן',1,3,16,2,7,'16:45:00','00:00:00',NULL),(75,'גן עפרוני','גבע 6','גבעתיים',0,3,20,3,7,'16:30:00','00:00:00',NULL),(76,'גן ברקן','בר יוחאי 15','רמת גן',0,2,25,3,7,'17:00:00','00:00:00',NULL),(77,'גן ניסנית','בר יוחאי 15','רמת גן',0,2,25,3,7,'17:00:00','00:00:00',NULL),(78,'גן ערבה','משמר הירדן 9','גבעתיים',0,3,30,6,7,'16:45:00','00:00:00',NULL),(79,'גן רמון','משמר הירדן 9','גבעתיים',0,3,30,6,7,'16:45:00','00:00:00',NULL),(80,'גן נטלי','חד נס 38','רמת גן',0,3,28,5,7,'17:00:00','00:00:00',NULL),(81,'המשפחתון של אסנת','חבר 9','רמת גן',0,3,12,2,7,'16:30:00','00:00:00',NULL),(82,'בייבי גן קרן','ארלוזרוב 75','תל אביב',0,3,20,4,7,'16:30:00','00:00:00',NULL),(83,'little steps','בן יהודה 190','תל אביב',0,3,26,4,7,'16:00:00','00:00:00',NULL),(84,'הגן של חגית','קלישר 4','הרצליה',1,4,70,4,7,'17:00:00','00:00:00',NULL),(85,'גן אמנון','טשרניחובסקי 38','הרצליה',1,3,36,4,7,'17:00:00','00:00:00',NULL),(86,'גן כמו בבית','החלוץ 22','רמת השרון',1,3,30,4,7,'16:30:00','00:00:00',NULL),(87,'גן דנה','ההגנה 69','הרצליה',1,3,20,3,7,'17:00:00','00:00:00',NULL),(88,'גן הדס','בר אילן 14','הרצליה',1,3,26,4,7,'17:00:00','00:00:00',NULL),(89,'גן בת-חן','הכורזי 6','הרצליה',1,3,24,4,7,'17:00:00','00:00:00',NULL),(90,'מעון נעמ\"ת הכוזרי','הכורזי 8','הרצליה',0,3,30,2,7,'16:30:00','00:00:00',NULL),(91,'גן עולם הילד','חנה סנש 10','הרצליה',1,3,30,3,7,'17:00:00','00:00:00',NULL),(92,'הגן שלנו','בן יהודה 55','הרצליה',1,2,20,4,7,'17:00:00','00:00:00',NULL),(93,'הגן של נאוה','בן גוריון 47','הרצליה',1,2,32,6,7,'17:00:00','00:00:00',NULL),(94,'גן פינוקים','רחוב א.ד גורדון 23','הרצליה',1,2,20,2,7,'17:00:00','00:00:00',NULL),(95,'הגן של ז\'אן','הבנים 21','הרצליה',1,3,15,3,7,'17:00:00','00:00:00',NULL),(96,'גן חני','משה 45','הרצליה',1,2,10,1,7,'17:00:00','00:00:00',NULL),(97,'גן הבית של יעלי','אחד העם 41','הרצליה',1,3,45,8,7,'17:00:00','00:00:00',NULL),(98,'גן במבינוס הרצליה','הבנים 50','הרצליה',0,4,20,3,7,'17:00:00','00:00:00',NULL),(99,'פעוטון סיגלי','מוהליבר 16','הרצליה',0,3,10,2,8,'16:00:00','00:00:52',NULL),(100,'גן טל','הינצנים 3','הרצליה',1,3,25,3,7,'17:00:00','00:00:00',NULL),(101,'גן תומר','בר כוכבא 48','הרצליה',1,3,22,2,7,'17:00:00','00:00:00',NULL),(102,'גן חיטים','המקובלים 38','הרצליה',1,3,28,3,7,'17:00:00','00:00:00',NULL),(103,'רש\"י שקד','שקד 33','תל אביב',1,3,3,1,7,'16:00:00','00:00:03',NULL),(104,'מעון יום','חריף אייזיק 21','תל אביב',1,3,6,2,7,'19:00:00','00:00:03',NULL),(105,'מעון יום','הרטוב 8','תל אביב',1,3,8,2,7,'16:00:00','00:00:03',NULL),(106,'מעון יום','עירית 15','תל אביב',1,3,20,3,7,'16:00:00','00:00:03',NULL),(107,'אמילי','כפר יונה 15','תל אביב',1,3,35,8,7,'16:00:00','00:00:03',NULL),(108,'אמילי','גבירטיג מרדכי 5','תל אביב',1,3,20,4,7,'16:00:00','00:00:03',NULL),(109,'מעון יום צהלה','המצביאים 28','תל אביב',1,3,18,4,7,'16:00:00','00:00:03',NULL),(110,'הדר יוסף','קהילת בריסק 10','תל אביב',1,3,20,5,7,'16:00:00','00:00:03',NULL),(111,'אביב TLV','החשמונאים 96','תל אביב',1,3,6,2,7,'16:00:00','00:00:03',NULL),(112,'פשר','זינגר בשביס יצחק 7','תל אביב',1,3,25,5,7,'16:00:00','00:00:03',NULL),(113,'בוגרשוב','בר כוכבא 26','תל אביב',0,0,17,4,7,'16:00:00','00:00:03',NULL),(114,'בירנית','בירנית 4','תל אביב',1,3,29,3,7,'16:00:00','00:00:03',NULL),(115,'בית מורצקי','חירותנו 1','תל אביב',0,0,32,4,7,'19:00:00','00:00:03',NULL),(116,'בית פורג\'','התקוה 70','תל אביב',1,3,30,5,7,'16:00:00','00:00:03',NULL),(117,'בית פרו','פעמונית 7','תל אביב',0,0,28,4,7,'19:00:00','00:00:03',NULL),(118,'המלך ג\'ורג\'','המלך ג\'ורג\' 35','תל אביב',0,0,20,6,7,'16:00:00','00:00:03',NULL),(119,'המשתלה','קיפניס לוין 6','תל אביב',1,3,15,4,7,'16:00:00','00:00:03',NULL),(120,'ויצמן','ויצמן 7','תל אביב',1,3,35,7,7,'16:00:00','00:00:03',NULL),(121,'יד אליהו','נגבה 33','תל אביב',1,3,14,3,7,'16:00:00','00:00:03',NULL),(122,'מגן אברהם','מגן אברהם 25','תל אביב',0,0,30,7,7,'19:00:00','00:00:03',NULL),(123,'נווה חן','סלע יעקב 22','תל אביב',1,3,8,3,7,'16:00:00','00:00:03',NULL),(124,'נווה צה\"ל','דרך ההגנה 118','תל אביב',1,3,6,2,7,'16:00:00','00:00:03',NULL),(125,'עקיבא ברון','ברון עקיבא 8','תל אביב',1,3,8,2,7,'16:00:00','00:00:03',NULL),(126,'פיינשטיין','פיינשטיין מאיר 20','תל אביב',1,3,20,3,7,'16:00:00','00:00:03',NULL),(127,'קריית שלום','ליוויק 7','תל אביב',0,0,35,8,7,'19:00:00','00:00:03',NULL),(128,'רמז ארלוזרוב','ארלוזורוב 95','תל אביב',1,3,20,4,7,'16:00:00','00:00:03',NULL),(129,'רמת ישראל','דם המכבים 21','תל אביב',1,3,18,4,7,'16:00:00','00:00:03',NULL),(130,'תכנית ל\'','בורלא יהודה 2','תל אביב',1,3,20,5,7,'16:00:00','00:00:03',NULL),(131,'שפירא','ישראל מסלנט 22','תל אביב',0,0,6,2,7,'19:00:00','00:00:03',NULL),(132,'האוניברסיטה, קמפוס ברושים','וייז ג\'ורג\' ד\"ר 1','תל אביב',0,0,25,5,7,'16:00:00','00:00:03',NULL),(133,'כוכב הצפון','קובנר אבא 16','תל אביב',1,3,17,4,7,'16:00:00','00:00:03',NULL),(134,'קטנטנים ובריאים','דפנה 7','תל אביב',0,0,29,3,7,'16:00:00','00:00:00',NULL),(135,'פלורנטין','פרנקל ידידיה 17','תל אביב',1,3,32,4,7,'16:00:00','00:00:03',NULL),(136,'ויצו','שלומציון המלכה 38','תל אביב',1,3,30,5,7,'16:00:00','00:00:03',NULL),(137,'ויצו','סלע יעקב 22','תל אביב',1,3,28,4,7,'16:00:00','00:00:03',NULL),(138,'רשבי - מוסדות ע\"ש התנא הקדוש','הרטוב 25','תל אביב',1,3,20,6,7,'16:00:00','00:00:03',NULL),(139,'בבלי','ירושלמי 16','תל אביב',1,3,15,4,7,'16:00:00','00:00:03',NULL),(140,'השלום','אריסטו 18','תל אביב',1,3,35,7,7,'16:00:00','00:00:03',NULL),(141,'מעגלים','חוני המעגל 5','תל אביב',1,3,14,3,7,'16:00:00','00:00:03',NULL),(142,'חיננית','חיננית 5','תל אביב',1,3,30,7,7,'16:00:00','00:00:03',NULL),(143,'נאות אפקה','לאה גולדברג 6','תל אביב',1,3,32,4,7,'16:00:00','00:00:03',NULL),(144,'נווה חן','סנפיר 9','תל אביב',1,3,30,5,7,'16:00:00','00:00:03',NULL),(145,'עצמאות','ארבר מנחם 26','תל אביב',0,0,28,4,7,'16:00:00','00:00:03',NULL),(146,'קרית שלום','שדרות גורי ישראל 23','תל אביב',1,3,20,6,7,'16:00:00','00:00:03',NULL),(147,'ניצנים','פן אלכסנדר 1','תל אביב',1,3,15,4,7,'16:00:00','00:00:03',NULL),(148,'נווה שרת','פילדלפיה 3','תל אביב',1,3,35,7,7,'16:00:00','00:00:03',NULL),(149,'דיזנגוף','דיזנגוף 221','תל אביב',1,3,14,3,7,'16:00:00','00:00:03',NULL),(150,'מאור עינים','מאור עינים 4','תל אביב',1,3,30,7,7,'16:00:00','00:00:03',NULL),(151,'גולדה','ברלין אליהו 4','תל אביב',1,3,6,2,7,'16:00:00','00:00:03',NULL),(152,'נעמת','בן סירא 4','תל אביב',1,3,25,5,7,'16:00:00','00:00:03',NULL),(153,'הברושים','לובטקין צביה 15','תל אביב',1,3,17,4,7,'16:00:00','00:00:03',NULL),(154,'גן אגוז ','זרובבל 3','רמת השרון',3,4,21,3,7,'15:30:00','00:00:03',NULL),(155,'גן תמר','זרובבל 3','רמת השרון',5,6,26,3,7,'15:30:00','00:00:03',NULL),(156,'גן זית','זרובבל 3','רמת השרון',4,5,18,2,7,'15:30:00','00:00:03',NULL),(157,'גן אמנון ותמר','הרב קוק 43','רמת השרון',4,6,35,4,7,'16:30:00','00:00:03',NULL),(158,'גן הרדוך','הנוטע 4','רמת השרון',3,4,35,7,7,'16:30:00','00:00:00',NULL),(159,'גן דובדבן','הפרחים 4','רמת השרון',4,6,33,6,7,'16:30:00','00:00:03',NULL),(160,'גן חרצית','השופטים 56','רמת השרון',3,5,23,5,7,'16:30:00','00:00:03',NULL),(161,'גן כרכום','אברבוך 14','רמת השרון',4,6,24,4,7,'16:30:00','00:00:03',NULL),(162,'גן ניצן','הירדן 25','רמת השרון',4,6,32,6,7,'16:30:00','00:00:03',NULL),(163,'גן נרקיס','מוהליבר 1','רמת השרון',5,6,28,4,7,'14:00:00','00:00:03',NULL),(164,'גן ענבר','הראשונים 14','רמת השרון',4,5,30,5,7,'16:30:00','00:00:00',NULL),(165,'גן ספיר','המלאכה 16','רמת השרון',3,4,17,3,7,'16:30:00','00:00:03',NULL),(166,'גן פשוש','הפלמ\"ח 8','רמת השרון',5,6,20,3,7,'16:30:00','00:00:03',NULL),(167,'גן צבעוני','אברבוך 14','רמת השרון',4,6,23,4,7,'14:00:00','00:00:03',NULL),(168,'גן צבר','רות 6','רמת השרון',5,6,26,4,7,'14:00:00','00:00:03',NULL),(169,'גן רותם','לילך 3','רמת השרון',4,6,23,3,7,'14:00:00','00:00:03',NULL),(170,'גן תות','הפרחים 4','רמת השרון',4,6,32,5,7,'16:30:00','00:00:03',NULL),(171,'גן איריס','הסייפן 37','רמת השרון',3,4,24,3,7,'14:00:00','00:00:03',NULL),(172,'גן אשל','אברהם 1','רמת השרון',3,4,21,3,7,'14:00:00','00:00:03',NULL),(173,'גן דפנה','עזרא 52','רמת השרון',3,4,34,4,7,'14:00:00','00:00:03',NULL),(174,'גן דקלים','יצחק שדה 54','רמת השרון',4,6,26,3,7,'14:00:00','00:00:03',NULL),(175,'גן חרצית','השופטים 56','רמת השרון',3,5,30,4,7,'15:30:00','00:00:03',NULL),(176,'גן חצב','הנוטע 3','רמת השרון',4,6,30,5,7,'16:30:00','00:00:03',NULL),(177,'גן דרור','הפלמ\"ח 8','רמת השרון',3,4,28,3,7,'14:00:00','00:00:03',NULL);
/*!40000 ALTER TABLE `kindergarten` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `kindergartenadditionalinfo`
--

DROP TABLE IF EXISTS `kindergartenadditionalinfo`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `kindergartenadditionalinfo` (
  `kindergarten_id` int unsigned NOT NULL AUTO_INCREMENT,
  `phone` varchar(45) DEFAULT NULL,
  `mail` varchar(45) DEFAULT NULL,
  `description` varchar(250) DEFAULT NULL,
  PRIMARY KEY (`kindergarten_id`),
  CONSTRAINT `FK_kindergarten_id` FOREIGN KEY (`kindergarten_id`) REFERENCES `kindergarten` (`kindergarten_id`) ON DELETE RESTRICT ON UPDATE RESTRICT
) ENGINE=InnoDB AUTO_INCREMENT=178 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `kindergartenadditionalinfo`
--

LOCK TABLES `kindergartenadditionalinfo` WRITE;
/*!40000 ALTER TABLE `kindergartenadditionalinfo` DISABLE KEYS */;
INSERT INTO `kindergartenadditionalinfo` VALUES (1,'052-7534788','','\r'),(2,'052-2739819','','\r'),(3,'054-5942332','','\r'),(4,'054-3052121','','\r'),(5,'054-9291997','','\r'),(6,'050-754-2437','','\r'),(7,'052-6426744','','\r'),(8,'','','\r'),(9,'050-221-2541','','\r'),(10,'37322490','','\r'),(11,'054-5489878','','\r'),(12,'03-5719759','','\r'),(13,'03-6725169','','\r'),(14,'03-5094497','','\r'),(15,'03-5719758','','\r'),(16,'03-571-9756','','\r'),(17,'','','\r'),(18,'03-5716601','','\r'),(19,'','','\r'),(20,'','','\r'),(21,'054-9718988','','\r'),(22,'054-669-8939','','\r'),(23,'','','\r'),(24,'052-5723388','','\r'),(25,'052-6693445','','\r'),(26,'054-2436690','','\r'),(27,'054-9475406','','\r'),(28,'','','\r'),(29,'052-3582935','','\r'),(30,'','','\r'),(31,'054-6470575','','\r'),(32,'054-4421245','','\r'),(33,'09-7428144','','\r'),(34,'054-6498352','','\r'),(35,'09-7673568','','\r'),(36,'054-8070898','','\r'),(37,'09-7652012','','\r'),(38,'052-569-7788','','\r'),(39,'09-768-7267','','\r'),(40,'09-7414546','','\r'),(41,'09-7480307','','\r'),(42,'054-4225044','','\r'),(43,'09-7658716','','\r'),(44,'054-3322848','','\r'),(45,'050-7926059','','\r'),(46,'054-3452926','','\r'),(47,'','','\r'),(48,'09-7655205','','\r'),(49,'054-5803992','','\r'),(50,'09-7674248','','\r'),(51,'09-7679186','','\r'),(52,'09-7891957','','\r'),(53,'053-242-2295','','\r'),(54,'','','\r'),(55,'054-630-7689','','\r'),(56,'','','\r'),(57,'077-702-7788','','\r'),(58,'','','\r'),(59,'','','\r'),(60,'050-719-2245','','\r'),(61,'03-717-2472','','\r'),(62,'03-676-1508','','\r'),(63,'03-574-6093','','\r'),(64,'03-574-6093','','\r'),(65,'03-574-6067','','\r'),(66,'050-452-5230','','\r'),(67,'','','\r'),(68,'','','\r'),(69,'','','\r'),(70,'','','\r'),(71,'','','\r'),(72,'','','\r'),(73,'03-505-4934','','\r'),(74,'03-574-6053','','\r'),(75,'03-571-9753','','\r'),(76,'03-574-6068','','\r'),(77,'03-574-6068','','\r'),(78,'03-540-6172','','\r'),(79,'03-573-0674','','\r'),(80,'','','\r'),(81,'','','\r'),(82,'054-815-1511','','\r'),(83,'054-789-7321','','\r'),(84,'09-950-3570','','\r'),(85,'09-950-3278','','\r'),(86,'054-439-4918','','\r'),(87,'','','\r'),(88,'','','\r'),(89,'09-956-4504','','\r'),(90,'09-954-1277','','\r'),(91,'073-758-9012','','\r'),(92,'','','\r'),(93,'','','\r'),(94,'','','\r'),(95,'09-954-4302','','\r'),(96,'09-954-4037','','\r'),(97,'073-702-7891','','\r'),(98,'09-951-3896','','\r'),(99,'052-6004913','','\r'),(100,'052-274-0863','','\r'),(101,'052-440-1316','','\r'),(102,'09-950-0101','','\r'),(103,'03-5185730','','\r'),(104,'03-6587804','','\r'),(105,'03-7300845','','\r'),(106,'03-6589236','','\r'),(107,'03-9715656','','\r'),(108,'03-6394870','','\r'),(109,'03-9669904','','\r'),(110,'03-6968603','','\r'),(111,'03-9491131','','\r'),(112,'03-5527127','','\r'),(113,'03-6290462','','\r'),(114,'03-7305861','','\r'),(115,'03-6870555','','\r'),(116,'03-6870239','','\r'),(117,'03-5061559','','\r'),(118,'03-5284230','','\r'),(119,'03-6443891','','\r'),(120,'03-6964832','','\r'),(121,'03-7392690','','\r'),(122,'03-6817650','','\r'),(123,'03-7393514','','\r'),(124,'03-7394005','','\r'),(125,'03-6414825','','\r'),(126,'03-6423660','','\r'),(127,'03-6839648','','\r'),(128,'03-6960437','','\r'),(129,'03-5711974','','\r'),(130,'03-6991990','','\r'),(131,'03-6876692','','\r'),(132,'03-7267274','','\r'),(133,'03-5754046','','\r'),(134,'076-8009023','','\r'),(135,'03-7394005','','\r'),(136,'03-6236499','','\r'),(137,'03-7393514','','\r'),(138,'03-7394668','','\r'),(139,'03-5467348','','\r'),(140,'03-5062525','','\r'),(141,'03-6041789','','\r'),(142,'03-6582555','','\r'),(143,'03-6487799','','\r'),(144,'03-7391079','','\r'),(145,'03-6821060','','\r'),(146,'03-6815288','','\r'),(147,'03-6484598','','\r'),(148,'03-6492329','','\r'),(149,'03-5441965','','\r'),(150,'03-9014794','','\r'),(151,'03-6826616','','\r'),(152,'03-6162976','','\r'),(153,'03-7394846','','\r'),(154,'03-7602145','','\r'),(155,'03-7602145','','\r'),(156,'03-7602145','','\r'),(157,'03-5406211','','\r'),(158,'','','\r'),(159,'03-6419364','','\r'),(160,'03-5258230','','\r'),(161,'03-5490215','','\r'),(162,'03-5405316','','\r'),(163,'03-5186888','','\r'),(164,'','','\r'),(165,'03-5497463','','\r'),(166,'03-5175932','','\r'),(167,'03-5474890','','\r'),(168,'03-5408152','','\r'),(169,'03-5497234','','\r'),(170,'03-6496028','','\r'),(171,'03-5497450','','\r'),(172,'03-5406221','','\r'),(173,'03-6885419','','\r'),(174,'03-5477180','','\r'),(175,'03-5258230','','\r'),(176,'03-5408113','','\r'),(177,'03-5175952','','\r');
/*!40000 ALTER TABLE `kindergartenadditionalinfo` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `parent`
--

DROP TABLE IF EXISTS `parent`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `parent` (
  `parent_id` int unsigned NOT NULL AUTO_INCREMENT,
  `username` varchar(200) NOT NULL,
  `password` varchar(16) NOT NULL,
  `name` varchar(100) NOT NULL,
  `home_address` varchar(1000) DEFAULT NULL,
  `home_region` varchar(100) DEFAULT NULL,
  `work_address` varchar(1000) DEFAULT NULL,
  `work_region` varchar(100) DEFAULT NULL,
  PRIMARY KEY (`parent_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `parent`
--

LOCK TABLES `parent` WRITE;
/*!40000 ALTER TABLE `parent` DISABLE KEYS */;
/*!40000 ALTER TABLE `parent` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2023-04-11 16:37:08
